app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "rails classroom"], ["room_number", 2], ["created_at", "2020-01-14 13:30:35.767719"], ["updated_at", "2020-01-14 13:30:35.767719"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["updated_at", "2020-01-14 16:09:40.351030"], ["id", 2]]