app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index # renders the index erb
        @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "bruno"], ["last_name", "oliveira"], ["created_at", "2020-01-14 13:31:14.855918"], ["updated_at", "2020-01-14 13:31:14.855918"]]
---
    def create # doesn't require a view
        @student = Student.new(student_params(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show # renders the show erb
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit # renders the edit erb
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "annes"], ["last_name", "kutrzeba "], ["updated_at", "2020-01-14 15:53:11.583817"], ["id", 3]]
---
    def update # doesn't require a view
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name)) # we permit these two arguments to be changed.
        redirect_to student_path(@student)